In [1]:
%load_ext sql

In [2]:
%%sql
mysql+pymysql://w-alkao:mypassword@localhost

In [3]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('ap',),
 ('ex',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [4]:
%sql USE livestock

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [5]:
%sql SHOW TABLES;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Animal',)]

## Index fulltext

...

In [6]:
%%sql

CREATE TABLE Book(
  id INT UNSIGNED PRIMARY KEY AUTO_INCREMENT,
  author VARCHAR(50),
  title VARCHAR(200)
)ENGINE = MyISAM;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [7]:
%sql DESCRIBE Book

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[('id', 'int unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('author', 'varchar(50)', 'YES', '', None, ''),
 ('title', 'varchar(200)', 'YES', '', None, '')]

In [8]:
%%sql

INSERT INTO Book (author, title) VALUES
  ('Daniel Pennac', 'Au bonheur des orgres'),
  ('Daniel Pennac', 'La Fée Carabine'),
  ('Daniel Pennac', 'Comme un roman'),
  ('Daniel Pennac', 'La Petite marchande de prose'),
  ('Jacqueline Harpman', 'Le Bonheur est dans le crime'),
  ('Jacqueline Harpman', 'La Dormition des amants'),
  ('Jacqueline Harpman', 'La Plage d''Ostende'),
  ('Jacqueline Harpman', 'Histoire de Jenny'),
  ('Terry Pratchett', 'Les Petits Dieux'),
  ('Terry Pratchett', 'Le Cinquième éléphant'),
  ('Terry Pratchett', 'La Vérité'),
  ('Terry Pratchett', 'Le Dernier héros'),
  ('Terry Goodkind', 'Le Temple des vents'),
  ('Jules Verne', 'De la Terre à la Lune'),
  ('Jules Verne', 'Voyage au centre de la Terre'),
  ('Henri-Pierre Roché', 'Jules et Jim');

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.

[]

In [9]:
%sql SELECT * FROM Book

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.

[(1, 'Daniel Pennac', 'Au bonheur des orgres'),
 (2, 'Daniel Pennac', 'La Fée Carabine'),
 (3, 'Daniel Pennac', 'Comme un roman'),
 (4, 'Daniel Pennac', 'La Petite marchande de prose'),
 (5, 'Jacqueline Harpman', 'Le Bonheur est dans le crime'),
 (6, 'Jacqueline Harpman', 'La Dormition des amants'),
 (7, 'Jacqueline Harpman', "La Plage d'Ostende"),
 (8, 'Jacqueline Harpman', 'Histoire de Jenny'),
 (9, 'Terry Pratchett', 'Les Petits Dieux'),
 (10, 'Terry Pratchett', 'Le Cinquième éléphant'),
 (11, 'Terry Pratchett', 'La Vérité'),
 (12, 'Terry Pratchett', 'Le Dernier héros'),
 (13, 'Terry Goodkind', 'Le Temple des vents'),
 (14, 'Jules Verne', 'De la Terre à la Lune'),
 (15, 'Jules Verne', 'Voyage au centre de la Terre'),
 (16, 'Henri-Pierre Roché', 'Jules et Jim')]

In [10]:
%%sql # Create index full text on colum author, title, (author and title)

CREATE FULLTEXT INDEX ind_full_title
  ON Book (title);

CREATE FULLTEXT INDEX ind_full_author
  ON Book (author);

CREATE FULLTEXT INDEX ind_full_title_author
  ON Book (title, author);

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.
16 rows affected.
16 rows affected.

[]

In [11]:
%sql DESCRIBE Book

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[('id', 'int unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('author', 'varchar(50)', 'YES', 'MUL', None, ''),
 ('title', 'varchar(200)', 'YES', 'MUL', None, '')]

### Natural language mode

In [12]:
%%sql # search for terry in author column

SELECT *
FROM Book
WHERE MATCH (author) AGAINST ('Terry')

 * mysql+pymysql://w-alkao:***@localhost
5 rows affected.

[(9, 'Terry Pratchett', 'Les Petits Dieux'),
 (10, 'Terry Pratchett', 'Le Cinquième éléphant'),
 (11, 'Terry Pratchett', 'La Vérité'),
 (12, 'Terry Pratchett', 'Le Dernier héros'),
 (13, 'Terry Goodkind', 'Le Temple des vents')]

In [13]:
%%sql #search for Petite in title column

SELECT * FROM Book
WHERE MATCH (title) AGAINST ('Petite')

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(4, 'Daniel Pennac', 'La Petite marchande de prose')]

In [14]:
%%sql # search for 

SELECT * FROM Book
WHERE MATCH (author, title) AGAINST('jules');

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[(14, 'Jules Verne', 'De la Terre à la Lune'),
 (16, 'Henri-Pierre Roché', 'Jules et Jim'),
 (15, 'Jules Verne', 'Voyage au centre de la Terre')]

In [15]:
%%sql #search for Jules Verne in title and author columns

SELECT * FROM Book
WHERE MATCH (title, author) AGAINST ('Jules Verne')

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[(14, 'Jules Verne', 'De la Terre à la Lune'),
 (15, 'Jules Verne', 'Voyage au centre de la Terre'),
 (16, 'Henri-Pierre Roché', 'Jules et Jim')]

In [16]:
%%sql # display the pertinence of the search

SELECT *, MATCH(title, author) AGAINST('Jules Verne Lune') AS pertinence
FROM Book

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.

[(1, 'Daniel Pennac', 'Au bonheur des orgres', 0.0),
 (2, 'Daniel Pennac', 'La Fée Carabine', 0.0),
 (3, 'Daniel Pennac', 'Comme un roman', 0.0),
 (4, 'Daniel Pennac', 'La Petite marchande de prose', 0.0),
 (5, 'Jacqueline Harpman', 'Le Bonheur est dans le crime', 0.0),
 (6, 'Jacqueline Harpman', 'La Dormition des amants', 0.0),
 (7, 'Jacqueline Harpman', "La Plage d'Ostende", 0.0),
 (8, 'Jacqueline Harpman', 'Histoire de Jenny', 0.0),
 (9, 'Terry Pratchett', 'Les Petits Dieux', 0.0),
 (10, 'Terry Pratchett', 'Le Cinquième éléphant', 0.0),
 (11, 'Terry Pratchett', 'La Vérité', 0.0),
 (12, 'Terry Pratchett', 'Le Dernier héros', 0.0),
 (13, 'Terry Goodkind', 'Le Temple des vents', 0.0),
 (14, 'Jules Verne', 'De la Terre à la Lune', 5.851144790649414),
 (15, 'Jules Verne', 'Voyage au centre de la Terre', 3.2267112731933594),
 (16, 'Henri-Pierre Roché', 'Jules et Jim', 1.4018518924713135)]

### boolean mode

In [17]:
%%sql # a search for title that must contains bonheur and not orgres

SELECT * FROM Book
WHERE MATCH (title) AGAINST("+bonheur -orgres" IN BOOLEAN MODE)

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(5, 'Jacqueline Harpman', 'Le Bonheur est dans le crime')]

In [18]:
%%sql #search for a title that must contains all the group of word in cote

SELECT * FROM Book
WHERE MATCH (title) AGAINST ('"Terre à la Lune"' IN BOOLEAN MODE)

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(14, 'Jules Verne', 'De la Terre à la Lune')]

In [19]:
%%sql #search for a title that must contains all the group of word in cote

SELECT * FROM Book
WHERE MATCH (title) AGAINST ('"Lune à la Terre"' IN BOOLEAN MODE)

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [20]:
%%sql # search for title which starts by petit

SELECT * FROM Book WHERE MATCH(title)
AGAINST("petit*" IN BOOLEAN MODE)

 * mysql+pymysql://w-alkao:***@localhost
2 rows affected.

[(4, 'Daniel Pennac', 'La Petite marchande de prose'),
 (9, 'Terry Pratchett', 'Les Petits Dieux')]

In [21]:
%%sql # search for title and author which contain a word starting by d

SELECT * FROM Book 
WHERE MATCH (author, title) AGAINST("d*" IN BOOLEAN MODE)

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[(1, 'Daniel Pennac', 'Au bonheur des orgres'),
 (2, 'Daniel Pennac', 'La Fée Carabine'),
 (3, 'Daniel Pennac', 'Comme un roman'),
 (4, 'Daniel Pennac', 'La Petite marchande de prose'),
 (5, 'Jacqueline Harpman', 'Le Bonheur est dans le crime'),
 (12, 'Terry Pratchett', 'Le Dernier héros'),
 (9, 'Terry Pratchett', 'Les Petits Dieux'),
 (6, 'Jacqueline Harpman', 'La Dormition des amants')]

In [22]:
%%sql # search for title which contains the word starting by petit bu not prose

SELECT * FROM Book
WHERE MATCH (title) AGAINST("petit* -prose" IN BOOLEAN MODE)

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(9, 'Terry Pratchett', 'Les Petits Dieux')]

### Query expansion

In [23]:
%%sql #search for daniel in title and author columns

SELECT * FROM Book
WHERE MATCH (title, author) AGAINST("Daniel")

 * mysql+pymysql://w-alkao:***@localhost
4 rows affected.

[(2, 'Daniel Pennac', 'La Fée Carabine'),
 (1, 'Daniel Pennac', 'Au bonheur des orgres'),
 (3, 'Daniel Pennac', 'Comme un roman'),
 (4, 'Daniel Pennac', 'La Petite marchande de prose')]

In [24]:
%%sql #search for daniel in title and author columns

SELECT * FROM Book
WHERE MATCH (title, author) AGAINST("Daniel" WITH QUERY EXPANSION)

 * mysql+pymysql://w-alkao:***@localhost
5 rows affected.

[(4, 'Daniel Pennac', 'La Petite marchande de prose'),
 (3, 'Daniel Pennac', 'Comme un roman'),
 (1, 'Daniel Pennac', 'Au bonheur des orgres'),
 (2, 'Daniel Pennac', 'La Fée Carabine'),
 (5, 'Jacqueline Harpman', 'Le Bonheur est dans le crime')]